import tkinter as tk
import random
heroes = ["暗夜猎手", "傲之追猎者", "爆破鬼才", "暴走萝莉", "北地之怒", "冰晶凤凰", "冰霜女巫", "不灭狂雷", "不屈之枪", "不祥之刃","残月之肃", "惩戒之箭", "愁云使者", "翠神", "大发明家", "德玛西亚之力", "德玛西亚之翼", "堕落天使", "恶魔小丑", "法外狂徒","风暴之怒", "复仇焰魂", "符文法师", "光辉女郎", "海兽祭司", "海洋之灾", "寒冰射手", "黑暗之女", "荒漠屠夫", "魂锁典狱长","皎月女神", "荆棘之兴", "九尾妖狐", "机械先驱", "巨魔之王", "卡牌大师", "狂暴之心", "炼金男爵", "炼金术士", "离群之刺","龙血武姬", "麦林炮手", "暮光之眼", "纳祖芒荣耀", "牛头酋长", "诺克萨斯统领", "诺克萨斯之手", "皮城女警", "皮城执法官","披甲龙龟", "镕铁少女", "熔岩巨兽", "沙漠皇帝", "沙漠玫瑰", "沙漠死神", "赏金猎人", "殇之木乃伊", "山隐之焰", "圣锤之毅","时光守护者", "兽灵行者", "上古领主", "死亡颂唱者", "探险家", "天启者", "痛苦之拥", "亡灵战神", "未来守护者", "瘟疫之源","无极剑圣", "武器大师", "无双剑姬", "无畏战车", "邪恶小法师", "猩红收割者", "雪原双子", "虚空遁地兽", "虚空恐惧", "虚空女皇","虚空行者", "虚空之眼", "迅捷斥候", "岩雀", "影流之主", "远古恐惧", "远古巫灵", "战争女神", "蒸汽机器人", "正义巨像","正义天使", "蜘蛛女皇", "众星之子", "祖安狂人", "祖安怒兽", "幻翎", "百裂冥犬", "牧魂人", "狂厄蔷薇", "深海泰坦", "琴瑟仙女","瓦洛兰之盾", "德玛西亚皇子", "深渊巨口", "不羁之悦", "英勇投弹手", "战争之影", "狂战士", "虚空掠夺者", "盲僧", "异画师", "潮汐海灵",'诡术妖姬','刀锋之影']
def show_random_hero():
    label.config(text=random.choice(heroes))
root = tk.Tk()
root.title("英雄联盟人机对战")
root.state('zoomed')
tk.Label()
label = tk.Label(root,font=("Arial", 48))
label.pack(pady=100)
button = tk.Button(root, text="随机选择英雄", font=("Arial", 36), command=show_random_hero)
button.pack(pady=50)
root.mainloop()